{"keras_version": "1.2.1", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 160, 320, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "batchnormalization_1", "config": {"mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "name": "batchnormalization_1", "epsilon": 0.001}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "BatchNormalization"}, {"name": "cropping2d_1", "config": {"cropping": [[60, 20], [0, 0]], "name": "cropping2d_1", "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Cropping2D"}, {"name": "averagepooling2d_1", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "averagepooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["cropping2d_1", 0, 0]]], "class_name": "AveragePooling2D"}, {"name": "convolution2d_1", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_1", "nb_row": 5, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "subsample": [2, 2], "trainable": true, "activation": "linear", "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "convolution2d_2", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 36, "name": "convolution2d_2", "nb_row": 5, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "subsample": [2, 2], "trainable": true, "activation": "linear", "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "convolution2d_3", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 48, "name": "convolution2d_3", "nb_row": 5, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "subsample": [2, 2], "trainable": true, "activation": "linear", "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "Convolution2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Flatten"}, {"name": "dropout_1", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_1", "config": {"output_dim": 100, "input_dim": 1632, "name": "dense_1", "b_regularizer": null, "bias": true, "trainable": true, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"p": 0.25, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"output_dim": 50, "input_dim": 100, "name": "dense_2", "b_regularizer": null, "bias": true, "trainable": true, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"name": "dropout_3", "config": {"p": 0.25, "name": "dropout_3", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"output_dim": 10, "input_dim": 50, "name": "dense_3", "b_regularizer": null, "bias": true, "trainable": true, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Dense"}, {"name": "dropout_4", "config": {"p": 0.25, "name": "dropout_4", "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_4", "config": {"output_dim": 1, "input_dim": 10, "name": "dense_4", "b_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Dense"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}